In [3]:
from pandas import read_csv

In [4]:
filename = 'daily_retail_price_Onion-upto_apr_2015.csv'
header_names = ['Date','Centre_Name','Commodity_Name','Price']
data = read_csv(filename,names = header_names)

In [5]:
data

            Date      Centre_Name Commodity_Name  Price
0       25-11-97            DELHI          Onion    8.0
1       25-11-97           SHIMLA          Onion    7.0
2       25-11-97          LUCKNOW          Onion    5.0
3       25-11-97        AHMEDABAD          Onion    6.0
4       25-11-97           BHOPAL          Onion    8.0
...          ...              ...            ...    ...
127906  28-04-15         DINDIGUL          Onion   18.0
127907  28-04-15  THIRUCHIRAPALLI          Onion   18.0
127908  28-04-15       COIMBATORE          Onion   18.0
127909  28-04-15      TIRUNELVELI          Onion   18.0
127910  28-04-15        HYDERABAD          Onion   22.0

[127911 rows x 4 columns]

In [7]:
print(data.dtypes)

Date               object
Centre_Name        object
Commodity_Name     object
Price             float64
dtype: object

In [8]:
data.ndim

2

In [10]:
data.shape

(127911, 4)

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 127911 entries, 0 to 127910
Data columns (total 4 columns):
Date              127911 non-null object
Centre_Name       127911 non-null object
Commodity_Name    127911 non-null object
Price             115991 non-null float64
dtypes: float64(1), object(3)
memory usage: 3.9+ MB

In [42]:
data['Price'].sort_values()

16130     2.0
16094     2.0
16112     2.0
12008     2.0
37260     2.0
         ...
127813    NaN
127815    NaN
127866    NaN
127867    NaN
127886    NaN
Name: Price, Length: 127911, dtype: float64

In [43]:
data.sort_values('Price')

            Date Centre_Name Commodity_Name  Price
16130   19-07-01      BHOPAL          Onion    2.0
16094   17-07-01      BHOPAL          Onion    2.0
16112   18-07-01      BHOPAL          Onion    2.0
12008   11-08-00      BHOPAL          Onion    2.0
37260   28-04-06      BHOPAL          Onion    2.0
...          ...         ...            ...    ...
127813  27-04-15    SILIGURI          Onion    NaN
127815  27-04-15    ITANAGAR          Onion    NaN
127866  28-04-15     GWALIOR          Onion    NaN
127867  28-04-15    JABALPUR          Onion    NaN
127886  28-04-15    ITANAGAR          Onion    NaN

[127911 rows x 4 columns]

In [44]:
data.sort_values('Centre_Name')

            Date Centre_Name Commodity_Name  Price
36711   10-03-06    AGARTALA          Onion    8.0
73531   06-05-11    AGARTALA          Onion   14.0
38758   23-08-06    AGARTALA          Onion   10.0
5772    22-03-99    AGARTALA          Onion   10.0
26127   21-10-03    AGARTALA          Onion   18.0
...          ...         ...            ...    ...
124296  09-02-15     WAYANAD          Onion   45.0
126909  07-04-15     WAYANAD          Onion   41.0
127548  21-04-15     WAYANAD          Onion   41.0
123624  22-01-15     WAYANAD          Onion   41.0
124160  05-02-15     WAYANAD          Onion   45.0

[127911 rows x 4 columns]

In [45]:
data.sort_values('Price').head()

           Date Centre_Name Commodity_Name  Price
16130  19-07-01      BHOPAL          Onion    2.0
16094  17-07-01      BHOPAL          Onion    2.0
16112  18-07-01      BHOPAL          Onion    2.0
12008  11-08-00      BHOPAL          Onion    2.0
37260  28-04-06      BHOPAL          Onion    2.0

In [46]:
data.sort_values('Price',ascending=False)

            Date Centre_Name Commodity_Name  Price
106332  13-11-13      AIZWAL          Onion  100.0
107016  02-12-13      AIZWAL          Onion  100.0
105933  04-11-13      AIZWAL          Onion  100.0
106161  08-11-13      AIZWAL          Onion  100.0
106047  06-11-13      AIZWAL          Onion  100.0
...          ...         ...            ...    ...
127813  27-04-15    SILIGURI          Onion    NaN
127815  27-04-15    ITANAGAR          Onion    NaN
127866  28-04-15     GWALIOR          Onion    NaN
127867  28-04-15    JABALPUR          Onion    NaN
127886  28-04-15    ITANAGAR          Onion    NaN

[127911 rows x 4 columns]

In [47]:
data.sort_values('Price',ascending=False)

            Date Centre_Name Commodity_Name  Price
106332  13-11-13      AIZWAL          Onion  100.0
107016  02-12-13      AIZWAL          Onion  100.0
105933  04-11-13      AIZWAL          Onion  100.0
106161  08-11-13      AIZWAL          Onion  100.0
106047  06-11-13      AIZWAL          Onion  100.0
...          ...         ...            ...    ...
127813  27-04-15    SILIGURI          Onion    NaN
127815  27-04-15    ITANAGAR          Onion    NaN
127866  28-04-15     GWALIOR          Onion    NaN
127867  28-04-15    JABALPUR          Onion    NaN
127886  28-04-15    ITANAGAR          Onion    NaN

[127911 rows x 4 columns]

this is a header

In [48]:
data.shape

# THIS IS A HEADER

(127911, 4)

In [13]:
data.head

<bound method NDFrame.head of             Date      Centre_Name Commodity_Name  Price
0       25-11-97            DELHI          Onion    8.0
1       25-11-97           SHIMLA          Onion    7.0
2       25-11-97          LUCKNOW          Onion    5.0
3       25-11-97        AHMEDABAD          Onion    6.0
4       25-11-97           BHOPAL          Onion    8.0
...          ...              ...            ...    ...
127906  28-04-15         DINDIGUL          Onion   18.0
127907  28-04-15  THIRUCHIRAPALLI          Onion   18.0
127908  28-04-15       COIMBATORE          Onion   18.0
127909  28-04-15      TIRUNELVELI          Onion   18.0
127910  28-04-15        HYDERABAD          Onion   22.0

[127911 rows x 4 columns]>

In [14]:
data.head()

       Date Centre_Name Commodity_Name  Price
0  25-11-97       DELHI          Onion    8.0
1  25-11-97      SHIMLA          Onion    7.0
2  25-11-97     LUCKNOW          Onion    5.0
3  25-11-97   AHMEDABAD          Onion    6.0
4  25-11-97      BHOPAL          Onion    8.0

In [15]:
data.tail()

            Date      Centre_Name Commodity_Name  Price
127906  28-04-15         DINDIGUL          Onion   18.0
127907  28-04-15  THIRUCHIRAPALLI          Onion   18.0
127908  28-04-15       COIMBATORE          Onion   18.0
127909  28-04-15      TIRUNELVELI          Onion   18.0
127910  28-04-15        HYDERABAD          Onion   22.0

In [16]:
data.tail(10)

            Date      Centre_Name Commodity_Name  Price
127901  28-04-15         THRISSUR          Onion   30.0
127902  28-04-15         PALAKKAD          Onion   24.0
127903  28-04-15          WAYANAD          Onion   41.0
127904  28-04-15       PUDUCHERRY          Onion   18.0
127905  28-04-15          CHENNAI          Onion   19.0
127906  28-04-15         DINDIGUL          Onion   18.0
127907  28-04-15  THIRUCHIRAPALLI          Onion   18.0
127908  28-04-15       COIMBATORE          Onion   18.0
127909  28-04-15      TIRUNELVELI          Onion   18.0
127910  28-04-15        HYDERABAD          Onion   22.0

In [17]:
data['Date']

0         25-11-97
1         25-11-97
2         25-11-97
3         25-11-97
4         25-11-97
            ...
127906    28-04-15
127907    28-04-15
127908    28-04-15
127909    28-04-15
127910    28-04-15
Name: Date, Length: 127911, dtype: object

In [18]:
data['Centre_Name']

0                   DELHI
1                  SHIMLA
2                 LUCKNOW
3               AHMEDABAD
4                  BHOPAL
               ...
127906           DINDIGUL
127907    THIRUCHIRAPALLI
127908         COIMBATORE
127909        TIRUNELVELI
127910          HYDERABAD
Name: Centre_Name, Length: 127911, dtype: object

In [55]:
data['Centre_Name'].nunique()

72

In [28]:
len(data.groupby('Centre_Name'))

72

In [29]:
len(data.groupby('Price'))

158

In [26]:
data['Centre_Name'].unique()

array(['DELHI', 'SHIMLA', 'LUCKNOW', 'AHMEDABAD', 'BHOPAL', 'MUMBAI',
       'JAIPUR', 'PATNA', 'BHUBANESHWAR', 'KOLKATA', 'GUWAHATI',
       'SHILLONG', 'AIZWAL', 'AGARTALA', 'BENGALURU', 'T.PURAM',
       'CHENNAI', 'HYDERABAD', 'CHANDIGARH', 'SRINAGAR', 'JAMMU',
       'AMRITSAR', 'LUDHIANA', 'DEHRADUN', 'RAIPUR', 'RANCHI', 'KOHIMA',
       'KANPUR', 'RAJKOT', 'VIJAYWADA', 'DINDIGUL', 'HISAR', 'KARNAL',
       'MANDI', 'BATHINDA', 'VARANASI', 'AGRA', 'INDORE', 'NAGPUR',
       'JODHPUR', 'KOTA', 'BHAGALPUR', 'CUTTACK', 'SAMBALPUR', 'SILIGURI',
       'ITANAGAR', 'DIMAPUR', 'DHARWAD', 'THIRUCHIRAPALLI', 'ERNAKULAM',
       'PORT BLAIR', 'PUDUCHERRY', 'PANAJI', 'GWALIOR', 'JABALPUR',
       'KOZHIKODE', 'ROURKELA', 'VISAKHAPATNAM', 'PANCHKULA', 'GURGAON',
       'REWA', 'SAGAR', 'COIMBATORE', 'TIRUNELVELI', 'PURNIA', 'THRISSUR',
       'PALAKKAD', 'WAYANAD', 'HALDWANI', 'DHARAMSHALA', 'MANGALORE',
       'MYSORE'], dtype=object)

In [27]:
data['Centre_Name'].value_counts()

LUCKNOW        4292
MUMBAI         4292
JAIPUR         4292
PATNA          4292
DELHI          4292
               ...
WAYANAD          68
HALDWANI         54
DHARAMSHALA      27
MANGALORE        22
MYSORE           22
Name: Centre_Name, Length: 72, dtype: int64

In [58]:
data['Commodity_Name'].value_counts()

Onion    127911
Name: Commodity_Name, dtype: int64

In [59]:
data['Price'].value_counts()

10.00    11278
12.00     8210
8.00      7537
20.00     7454
15.00     6278
         ...
20.50        1
8.55         1
3.80         1
18.40        1
6.60         1
Name: Price, Length: 158, dtype: int64

In [30]:
data.drop(['Date', 'Commodity_Name'],axis=1)

            Centre_Name  Price
0                 DELHI    8.0
1                SHIMLA    7.0
2               LUCKNOW    5.0
3             AHMEDABAD    6.0
4                BHOPAL    8.0
...                 ...    ...
127906         DINDIGUL   18.0
127907  THIRUCHIRAPALLI   18.0
127908       COIMBATORE   18.0
127909      TIRUNELVELI   18.0
127910        HYDERABAD   22.0

[127911 rows x 2 columns]

In [61]:
data.drop(columns=['Date', 'Commodity_Name'])

            Centre_Name  Price
0                 DELHI    8.0
1                SHIMLA    7.0
2               LUCKNOW    5.0
3             AHMEDABAD    6.0
4                BHOPAL    8.0
...                 ...    ...
127906         DINDIGUL   18.0
127907  THIRUCHIRAPALLI   18.0
127908       COIMBATORE   18.0
127909      TIRUNELVELI   18.0
127910        HYDERABAD   22.0

[127911 rows x 2 columns]

In [62]:
data

            Date      Centre_Name Commodity_Name  Price
0       25-11-97            DELHI          Onion    8.0
1       25-11-97           SHIMLA          Onion    7.0
2       25-11-97          LUCKNOW          Onion    5.0
3       25-11-97        AHMEDABAD          Onion    6.0
4       25-11-97           BHOPAL          Onion    8.0
...          ...              ...            ...    ...
127906  28-04-15         DINDIGUL          Onion   18.0
127907  28-04-15  THIRUCHIRAPALLI          Onion   18.0
127908  28-04-15       COIMBATORE          Onion   18.0
127909  28-04-15      TIRUNELVELI          Onion   18.0
127910  28-04-15        HYDERABAD          Onion   22.0

[127911 rows x 4 columns]

In [63]:
data['Date'] #print(data['Date', 'Commodity_Name'])

0         25-11-97
1         25-11-97
2         25-11-97
3         25-11-97
4         25-11-97
            ...
127906    28-04-15
127907    28-04-15
127908    28-04-15
127909    28-04-15
127910    28-04-15
Name: Date, Length: 127911, dtype: object

In [75]:
data[['Date', 'Price']]

            Date  Price
0       25-11-97    8.0
1       25-11-97    7.0
2       25-11-97    5.0
3       25-11-97    6.0
4       25-11-97    8.0
...          ...    ...
127906  28-04-15   18.0
127907  28-04-15   18.0
127908  28-04-15   18.0
127909  28-04-15   18.0
127910  28-04-15   22.0

[127911 rows x 2 columns]

In [74]:
data.iloc[:, 0:2]

            Date      Centre_Name
0       25-11-97            DELHI
1       25-11-97           SHIMLA
2       25-11-97          LUCKNOW
3       25-11-97        AHMEDABAD
4       25-11-97           BHOPAL
...          ...              ...
127906  28-04-15         DINDIGUL
127907  28-04-15  THIRUCHIRAPALLI
127908  28-04-15       COIMBATORE
127909  28-04-15      TIRUNELVELI
127910  28-04-15        HYDERABAD

[127911 rows x 2 columns]

In [65]:
data.sort_values('Price')

            Date Centre_Name Commodity_Name  Price
16130   19-07-01      BHOPAL          Onion    2.0
16094   17-07-01      BHOPAL          Onion    2.0
16112   18-07-01      BHOPAL          Onion    2.0
12008   11-08-00      BHOPAL          Onion    2.0
37260   28-04-06      BHOPAL          Onion    2.0
...          ...         ...            ...    ...
127813  27-04-15    SILIGURI          Onion    NaN
127815  27-04-15    ITANAGAR          Onion    NaN
127866  28-04-15     GWALIOR          Onion    NaN
127867  28-04-15    JABALPUR          Onion    NaN
127886  28-04-15    ITANAGAR          Onion    NaN

[127911 rows x 4 columns]

In [66]:
list(data['Price'].sort_values())

[2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.0,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.5,
 2.75,
 2.75,
 2.75,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 3.0,
 ...]

In [67]:
data['Price'].sort_values()

16130     2.0
16094     2.0
16112     2.0
12008     2.0
37260     2.0
         ...
127813    NaN
127815    NaN
127866    NaN
127867    NaN
127886    NaN
Name: Price, Length: 127911, dtype: float64

In [69]:
data[data.columns[1:3]]

            Centre_Name Commodity_Name
0                 DELHI          Onion
1                SHIMLA          Onion
2               LUCKNOW          Onion
3             AHMEDABAD          Onion
4                BHOPAL          Onion
...                 ...            ...
127906         DINDIGUL          Onion
127907  THIRUCHIRAPALLI          Onion
127908       COIMBATORE          Onion
127909      TIRUNELVELI          Onion
127910        HYDERABAD          Onion

[127911 rows x 2 columns]

In [70]:
data.drop(columns=['Date', 'Commodity_Name'])

            Centre_Name  Price
0                 DELHI    8.0
1                SHIMLA    7.0
2               LUCKNOW    5.0
3             AHMEDABAD    6.0
4                BHOPAL    8.0
...                 ...    ...
127906         DINDIGUL   18.0
127907  THIRUCHIRAPALLI   18.0
127908       COIMBATORE   18.0
127909      TIRUNELVELI   18.0
127910        HYDERABAD   22.0

[127911 rows x 2 columns]

In [71]:
data.rename(columns={"Date": "Date_of_Sale"})

       Date_of_Sale      Centre_Name Commodity_Name  Price
0          25-11-97            DELHI          Onion    8.0
1          25-11-97           SHIMLA          Onion    7.0
2          25-11-97          LUCKNOW          Onion    5.0
3          25-11-97        AHMEDABAD          Onion    6.0
4          25-11-97           BHOPAL          Onion    8.0
...             ...              ...            ...    ...
127906     28-04-15         DINDIGUL          Onion   18.0
127907     28-04-15  THIRUCHIRAPALLI          Onion   18.0
127908     28-04-15       COIMBATORE          Onion   18.0
127909     28-04-15      TIRUNELVELI          Onion   18.0
127910     28-04-15        HYDERABAD          Onion   22.0

[127911 rows x 4 columns]

In [32]:
len(df.isnull())

72